# 1. Берем за основу официальный образ Питона (версия slim весит мало и быстро качается)
FROM python:3.9-slim

# 2. Говорим Докеру: "Все дальнейшие команды выполняй в папке /app внутри контейнера"
WORKDIR /app

# 3. Копируем список зависимостей с твоего компа внутрь контейнера
COPY requirements.txt .

# 4. Устанавливаем библиотеки (наш redis). 
# Флаг --no-cache-dir не сохраняет кэш скачанных файлов, чтобы образ был легким.
RUN pip install --no-cache-dir -r requirements.txt

# 5. Копируем сам код твоего ИИ-Воркера
COPY worker.py .

# 6. Главная команда: что делать контейнеру, когда он запустится
CMD ["python", "worker.py"]